VisionTransformer(
  (conv_proj): Conv2d(3, 1280, kernel_size=(14, 14), stride=(14, 14))
  (encoder): Encoder(
    (dropout): Dropout(p=0.0, inplace=False)
    (layers): Sequential(
      (encoder_layer_0): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_1): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_2): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_3): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_4): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_5): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_6): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_7): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_8): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_9): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_10): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_11): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_12): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_13): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_14): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_15): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_16): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_17): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_18): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_19): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_20): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_21): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_22): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_23): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_24): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_25): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_26): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_27): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_28): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_29): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_30): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
      (encoder_layer_31): EncoderBlock(
        (ln_1): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (self_attention): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=1280, out_features=1280, bias=True)
        )
        (dropout): Dropout(p=0.0, inplace=False)
        (ln_2): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
        (mlp): MLPBlock(
          (0): Linear(in_features=1280, out_features=5120, bias=True)
          (1): GELU(approximate='none')
          (2): Dropout(p=0.0, inplace=False)
          (3): Linear(in_features=5120, out_features=1280, bias=True)
          (4): Dropout(p=0.0, inplace=False)
        )
      )
    )
    (ln): LayerNorm((1280,), eps=1e-06, elementwise_affine=True)
  )
  (heads): Sequential(
    (head): Linear(in_features=1280, out_features=1000, bias=True)
  )
)
pth文件的类型是：<class 'collections.OrderedDict'>
pth文件的字典长度是：392
------pth文件的字典key包含------
key:
class_token
conv_proj.weight
conv_proj.bias
encoder.pos_embedding
encoder.layers.encoder_layer_0.ln_1.weight
encoder.layers.encoder_layer_0.ln_1.bias
encoder.layers.encoder_layer_0.self_attention.in_proj_weight
encoder.layers.encoder_layer_0.self_attention.in_proj_bias
encoder.layers.encoder_layer_0.self_attention.out_proj.weight
encoder.layers.encoder_layer_0.self_attention.out_proj.bias
encoder.layers.encoder_layer_0.ln_2.weight
encoder.layers.encoder_layer_0.ln_2.bias
encoder.layers.encoder_layer_0.mlp.linear_1.weight
encoder.layers.encoder_layer_0.mlp.linear_1.bias
encoder.layers.encoder_layer_0.mlp.linear_2.weight
encoder.layers.encoder_layer_0.mlp.linear_2.bias
encoder.layers.encoder_layer_1.ln_1.weight
encoder.layers.encoder_layer_1.ln_1.bias
encoder.layers.encoder_layer_1.self_attention.in_proj_weight
encoder.layers.encoder_layer_1.self_attention.in_proj_bias
encoder.layers.encoder_layer_1.self_attention.out_proj.weight
encoder.layers.encoder_layer_1.self_attention.out_proj.bias
encoder.layers.encoder_layer_1.ln_2.weight
encoder.layers.encoder_layer_1.ln_2.bias
encoder.layers.encoder_layer_1.mlp.linear_1.weight
encoder.layers.encoder_layer_1.mlp.linear_1.bias
encoder.layers.encoder_layer_1.mlp.linear_2.weight
encoder.layers.encoder_layer_1.mlp.linear_2.bias
encoder.layers.encoder_layer_2.ln_1.weight
encoder.layers.encoder_layer_2.ln_1.bias
encoder.layers.encoder_layer_2.self_attention.in_proj_weight
encoder.layers.encoder_layer_2.self_attention.in_proj_bias
encoder.layers.encoder_layer_2.self_attention.out_proj.weight
encoder.layers.encoder_layer_2.self_attention.out_proj.bias
encoder.layers.encoder_layer_2.ln_2.weight
encoder.layers.encoder_layer_2.ln_2.bias
encoder.layers.encoder_layer_2.mlp.linear_1.weight
encoder.layers.encoder_layer_2.mlp.linear_1.bias
encoder.layers.encoder_layer_2.mlp.linear_2.weight
encoder.layers.encoder_layer_2.mlp.linear_2.bias
encoder.layers.encoder_layer_3.ln_1.weight
encoder.layers.encoder_layer_3.ln_1.bias
encoder.layers.encoder_layer_3.self_attention.in_proj_weight
encoder.layers.encoder_layer_3.self_attention.in_proj_bias
encoder.layers.encoder_layer_3.self_attention.out_proj.weight
encoder.layers.encoder_layer_3.self_attention.out_proj.bias
encoder.layers.encoder_layer_3.ln_2.weight
encoder.layers.encoder_layer_3.ln_2.bias
encoder.layers.encoder_layer_3.mlp.linear_1.weight
encoder.layers.encoder_layer_3.mlp.linear_1.bias
encoder.layers.encoder_layer_3.mlp.linear_2.weight
encoder.layers.encoder_layer_3.mlp.linear_2.bias
encoder.layers.encoder_layer_4.ln_1.weight
encoder.layers.encoder_layer_4.ln_1.bias
encoder.layers.encoder_layer_4.self_attention.in_proj_weight
encoder.layers.encoder_layer_4.self_attention.in_proj_bias
encoder.layers.encoder_layer_4.self_attention.out_proj.weight
encoder.layers.encoder_layer_4.self_attention.out_proj.bias
encoder.layers.encoder_layer_4.ln_2.weight
encoder.layers.encoder_layer_4.ln_2.bias
encoder.layers.encoder_layer_4.mlp.linear_1.weight
encoder.layers.encoder_layer_4.mlp.linear_1.bias
encoder.layers.encoder_layer_4.mlp.linear_2.weight
encoder.layers.encoder_layer_4.mlp.linear_2.bias
encoder.layers.encoder_layer_5.ln_1.weight
encoder.layers.encoder_layer_5.ln_1.bias
encoder.layers.encoder_layer_5.self_attention.in_proj_weight
encoder.layers.encoder_layer_5.self_attention.in_proj_bias
encoder.layers.encoder_layer_5.self_attention.out_proj.weight
encoder.layers.encoder_layer_5.self_attention.out_proj.bias
encoder.layers.encoder_layer_5.ln_2.weight
encoder.layers.encoder_layer_5.ln_2.bias
encoder.layers.encoder_layer_5.mlp.linear_1.weight
encoder.layers.encoder_layer_5.mlp.linear_1.bias
encoder.layers.encoder_layer_5.mlp.linear_2.weight
encoder.layers.encoder_layer_5.mlp.linear_2.bias
encoder.layers.encoder_layer_6.ln_1.weight
encoder.layers.encoder_layer_6.ln_1.bias
encoder.layers.encoder_layer_6.self_attention.in_proj_weight
encoder.layers.encoder_layer_6.self_attention.in_proj_bias
encoder.layers.encoder_layer_6.self_attention.out_proj.weight
encoder.layers.encoder_layer_6.self_attention.out_proj.bias
encoder.layers.encoder_layer_6.ln_2.weight
encoder.layers.encoder_layer_6.ln_2.bias
encoder.layers.encoder_layer_6.mlp.linear_1.weight
encoder.layers.encoder_layer_6.mlp.linear_1.bias
encoder.layers.encoder_layer_6.mlp.linear_2.weight
encoder.layers.encoder_layer_6.mlp.linear_2.bias
encoder.layers.encoder_layer_7.ln_1.weight
encoder.layers.encoder_layer_7.ln_1.bias
encoder.layers.encoder_layer_7.self_attention.in_proj_weight
encoder.layers.encoder_layer_7.self_attention.in_proj_bias
encoder.layers.encoder_layer_7.self_attention.out_proj.weight
encoder.layers.encoder_layer_7.self_attention.out_proj.bias
encoder.layers.encoder_layer_7.ln_2.weight
encoder.layers.encoder_layer_7.ln_2.bias
encoder.layers.encoder_layer_7.mlp.linear_1.weight
encoder.layers.encoder_layer_7.mlp.linear_1.bias
encoder.layers.encoder_layer_7.mlp.linear_2.weight
encoder.layers.encoder_layer_7.mlp.linear_2.bias
encoder.layers.encoder_layer_8.ln_1.weight
encoder.layers.encoder_layer_8.ln_1.bias
encoder.layers.encoder_layer_8.self_attention.in_proj_weight
encoder.layers.encoder_layer_8.self_attention.in_proj_bias
encoder.layers.encoder_layer_8.self_attention.out_proj.weight
encoder.layers.encoder_layer_8.self_attention.out_proj.bias
encoder.layers.encoder_layer_8.ln_2.weight
encoder.layers.encoder_layer_8.ln_2.bias
encoder.layers.encoder_layer_8.mlp.linear_1.weight
encoder.layers.encoder_layer_8.mlp.linear_1.bias
encoder.layers.encoder_layer_8.mlp.linear_2.weight
encoder.layers.encoder_layer_8.mlp.linear_2.bias
encoder.layers.encoder_layer_9.ln_1.weight
encoder.layers.encoder_layer_9.ln_1.bias
encoder.layers.encoder_layer_9.self_attention.in_proj_weight
encoder.layers.encoder_layer_9.self_attention.in_proj_bias
encoder.layers.encoder_layer_9.self_attention.out_proj.weight
encoder.layers.encoder_layer_9.self_attention.out_proj.bias
encoder.layers.encoder_layer_9.ln_2.weight
encoder.layers.encoder_layer_9.ln_2.bias
encoder.layers.encoder_layer_9.mlp.linear_1.weight
encoder.layers.encoder_layer_9.mlp.linear_1.bias
encoder.layers.encoder_layer_9.mlp.linear_2.weight
encoder.layers.encoder_layer_9.mlp.linear_2.bias
encoder.layers.encoder_layer_10.ln_1.weight
encoder.layers.encoder_layer_10.ln_1.bias
encoder.layers.encoder_layer_10.self_attention.in_proj_weight
encoder.layers.encoder_layer_10.self_attention.in_proj_bias
encoder.layers.encoder_layer_10.self_attention.out_proj.weight
encoder.layers.encoder_layer_10.self_attention.out_proj.bias
encoder.layers.encoder_layer_10.ln_2.weight
encoder.layers.encoder_layer_10.ln_2.bias
encoder.layers.encoder_layer_10.mlp.linear_1.weight
encoder.layers.encoder_layer_10.mlp.linear_1.bias
encoder.layers.encoder_layer_10.mlp.linear_2.weight
encoder.layers.encoder_layer_10.mlp.linear_2.bias
encoder.layers.encoder_layer_11.ln_1.weight
encoder.layers.encoder_layer_11.ln_1.bias
encoder.layers.encoder_layer_11.self_attention.in_proj_weight
encoder.layers.encoder_layer_11.self_attention.in_proj_bias
encoder.layers.encoder_layer_11.self_attention.out_proj.weight
encoder.layers.encoder_layer_11.self_attention.out_proj.bias
encoder.layers.encoder_layer_11.ln_2.weight
encoder.layers.encoder_layer_11.ln_2.bias
encoder.layers.encoder_layer_11.mlp.linear_1.weight
encoder.layers.encoder_layer_11.mlp.linear_1.bias
encoder.layers.encoder_layer_11.mlp.linear_2.weight
encoder.layers.encoder_layer_11.mlp.linear_2.bias
encoder.layers.encoder_layer_12.ln_1.weight
encoder.layers.encoder_layer_12.ln_1.bias
encoder.layers.encoder_layer_12.self_attention.in_proj_weight
encoder.layers.encoder_layer_12.self_attention.in_proj_bias
encoder.layers.encoder_layer_12.self_attention.out_proj.weight
encoder.layers.encoder_layer_12.self_attention.out_proj.bias
encoder.layers.encoder_layer_12.ln_2.weight
encoder.layers.encoder_layer_12.ln_2.bias
encoder.layers.encoder_layer_12.mlp.linear_1.weight
encoder.layers.encoder_layer_12.mlp.linear_1.bias
encoder.layers.encoder_layer_12.mlp.linear_2.weight
encoder.layers.encoder_layer_12.mlp.linear_2.bias
encoder.layers.encoder_layer_13.ln_1.weight
encoder.layers.encoder_layer_13.ln_1.bias
encoder.layers.encoder_layer_13.self_attention.in_proj_weight
encoder.layers.encoder_layer_13.self_attention.in_proj_bias
encoder.layers.encoder_layer_13.self_attention.out_proj.weight
encoder.layers.encoder_layer_13.self_attention.out_proj.bias
encoder.layers.encoder_layer_13.ln_2.weight
encoder.layers.encoder_layer_13.ln_2.bias
encoder.layers.encoder_layer_13.mlp.linear_1.weight
encoder.layers.encoder_layer_13.mlp.linear_1.bias
encoder.layers.encoder_layer_13.mlp.linear_2.weight
encoder.layers.encoder_layer_13.mlp.linear_2.bias
encoder.layers.encoder_layer_14.ln_1.weight
encoder.layers.encoder_layer_14.ln_1.bias
encoder.layers.encoder_layer_14.self_attention.in_proj_weight
encoder.layers.encoder_layer_14.self_attention.in_proj_bias
encoder.layers.encoder_layer_14.self_attention.out_proj.weight
encoder.layers.encoder_layer_14.self_attention.out_proj.bias
encoder.layers.encoder_layer_14.ln_2.weight
encoder.layers.encoder_layer_14.ln_2.bias
encoder.layers.encoder_layer_14.mlp.linear_1.weight
encoder.layers.encoder_layer_14.mlp.linear_1.bias
encoder.layers.encoder_layer_14.mlp.linear_2.weight
encoder.layers.encoder_layer_14.mlp.linear_2.bias
encoder.layers.encoder_layer_15.ln_1.weight
encoder.layers.encoder_layer_15.ln_1.bias
encoder.layers.encoder_layer_15.self_attention.in_proj_weight
encoder.layers.encoder_layer_15.self_attention.in_proj_bias
encoder.layers.encoder_layer_15.self_attention.out_proj.weight
encoder.layers.encoder_layer_15.self_attention.out_proj.bias
encoder.layers.encoder_layer_15.ln_2.weight
encoder.layers.encoder_layer_15.ln_2.bias
encoder.layers.encoder_layer_15.mlp.linear_1.weight
encoder.layers.encoder_layer_15.mlp.linear_1.bias
encoder.layers.encoder_layer_15.mlp.linear_2.weight
encoder.layers.encoder_layer_15.mlp.linear_2.bias
encoder.layers.encoder_layer_16.ln_1.weight
encoder.layers.encoder_layer_16.ln_1.bias
encoder.layers.encoder_layer_16.self_attention.in_proj_weight
encoder.layers.encoder_layer_16.self_attention.in_proj_bias
encoder.layers.encoder_layer_16.self_attention.out_proj.weight
encoder.layers.encoder_layer_16.self_attention.out_proj.bias
encoder.layers.encoder_layer_16.ln_2.weight
encoder.layers.encoder_layer_16.ln_2.bias
encoder.layers.encoder_layer_16.mlp.linear_1.weight
encoder.layers.encoder_layer_16.mlp.linear_1.bias
encoder.layers.encoder_layer_16.mlp.linear_2.weight
encoder.layers.encoder_layer_16.mlp.linear_2.bias
encoder.layers.encoder_layer_17.ln_1.weight
encoder.layers.encoder_layer_17.ln_1.bias
encoder.layers.encoder_layer_17.self_attention.in_proj_weight
encoder.layers.encoder_layer_17.self_attention.in_proj_bias
encoder.layers.encoder_layer_17.self_attention.out_proj.weight
encoder.layers.encoder_layer_17.self_attention.out_proj.bias
encoder.layers.encoder_layer_17.ln_2.weight
encoder.layers.encoder_layer_17.ln_2.bias
encoder.layers.encoder_layer_17.mlp.linear_1.weight
encoder.layers.encoder_layer_17.mlp.linear_1.bias
encoder.layers.encoder_layer_17.mlp.linear_2.weight
encoder.layers.encoder_layer_17.mlp.linear_2.bias
encoder.layers.encoder_layer_18.ln_1.weight
encoder.layers.encoder_layer_18.ln_1.bias
encoder.layers.encoder_layer_18.self_attention.in_proj_weight
encoder.layers.encoder_layer_18.self_attention.in_proj_bias
encoder.layers.encoder_layer_18.self_attention.out_proj.weight
encoder.layers.encoder_layer_18.self_attention.out_proj.bias
encoder.layers.encoder_layer_18.ln_2.weight
encoder.layers.encoder_layer_18.ln_2.bias
encoder.layers.encoder_layer_18.mlp.linear_1.weight
encoder.layers.encoder_layer_18.mlp.linear_1.bias
encoder.layers.encoder_layer_18.mlp.linear_2.weight
encoder.layers.encoder_layer_18.mlp.linear_2.bias
encoder.layers.encoder_layer_19.ln_1.weight
encoder.layers.encoder_layer_19.ln_1.bias
encoder.layers.encoder_layer_19.self_attention.in_proj_weight
encoder.layers.encoder_layer_19.self_attention.in_proj_bias
encoder.layers.encoder_layer_19.self_attention.out_proj.weight
encoder.layers.encoder_layer_19.self_attention.out_proj.bias
encoder.layers.encoder_layer_19.ln_2.weight
encoder.layers.encoder_layer_19.ln_2.bias
encoder.layers.encoder_layer_19.mlp.linear_1.weight
encoder.layers.encoder_layer_19.mlp.linear_1.bias
encoder.layers.encoder_layer_19.mlp.linear_2.weight
encoder.layers.encoder_layer_19.mlp.linear_2.bias
encoder.layers.encoder_layer_20.ln_1.weight
encoder.layers.encoder_layer_20.ln_1.bias
encoder.layers.encoder_layer_20.self_attention.in_proj_weight
encoder.layers.encoder_layer_20.self_attention.in_proj_bias
encoder.layers.encoder_layer_20.self_attention.out_proj.weight
encoder.layers.encoder_layer_20.self_attention.out_proj.bias
encoder.layers.encoder_layer_20.ln_2.weight
encoder.layers.encoder_layer_20.ln_2.bias
encoder.layers.encoder_layer_20.mlp.linear_1.weight
encoder.layers.encoder_layer_20.mlp.linear_1.bias
encoder.layers.encoder_layer_20.mlp.linear_2.weight
encoder.layers.encoder_layer_20.mlp.linear_2.bias
encoder.layers.encoder_layer_21.ln_1.weight
encoder.layers.encoder_layer_21.ln_1.bias
encoder.layers.encoder_layer_21.self_attention.in_proj_weight
encoder.layers.encoder_layer_21.self_attention.in_proj_bias
encoder.layers.encoder_layer_21.self_attention.out_proj.weight
encoder.layers.encoder_layer_21.self_attention.out_proj.bias
encoder.layers.encoder_layer_21.ln_2.weight
encoder.layers.encoder_layer_21.ln_2.bias
encoder.layers.encoder_layer_21.mlp.linear_1.weight
encoder.layers.encoder_layer_21.mlp.linear_1.bias
encoder.layers.encoder_layer_21.mlp.linear_2.weight
encoder.layers.encoder_layer_21.mlp.linear_2.bias
encoder.layers.encoder_layer_22.ln_1.weight
encoder.layers.encoder_layer_22.ln_1.bias
encoder.layers.encoder_layer_22.self_attention.in_proj_weight
encoder.layers.encoder_layer_22.self_attention.in_proj_bias
encoder.layers.encoder_layer_22.self_attention.out_proj.weight
encoder.layers.encoder_layer_22.self_attention.out_proj.bias
encoder.layers.encoder_layer_22.ln_2.weight
encoder.layers.encoder_layer_22.ln_2.bias
encoder.layers.encoder_layer_22.mlp.linear_1.weight
encoder.layers.encoder_layer_22.mlp.linear_1.bias
encoder.layers.encoder_layer_22.mlp.linear_2.weight
encoder.layers.encoder_layer_22.mlp.linear_2.bias
encoder.layers.encoder_layer_23.ln_1.weight
encoder.layers.encoder_layer_23.ln_1.bias
encoder.layers.encoder_layer_23.self_attention.in_proj_weight
encoder.layers.encoder_layer_23.self_attention.in_proj_bias
encoder.layers.encoder_layer_23.self_attention.out_proj.weight
encoder.layers.encoder_layer_23.self_attention.out_proj.bias
encoder.layers.encoder_layer_23.ln_2.weight
encoder.layers.encoder_layer_23.ln_2.bias
encoder.layers.encoder_layer_23.mlp.linear_1.weight
encoder.layers.encoder_layer_23.mlp.linear_1.bias
encoder.layers.encoder_layer_23.mlp.linear_2.weight
encoder.layers.encoder_layer_23.mlp.linear_2.bias
encoder.layers.encoder_layer_24.ln_1.weight
encoder.layers.encoder_layer_24.ln_1.bias
encoder.layers.encoder_layer_24.self_attention.in_proj_weight
encoder.layers.encoder_layer_24.self_attention.in_proj_bias
encoder.layers.encoder_layer_24.self_attention.out_proj.weight
encoder.layers.encoder_layer_24.self_attention.out_proj.bias
encoder.layers.encoder_layer_24.ln_2.weight
encoder.layers.encoder_layer_24.ln_2.bias
encoder.layers.encoder_layer_24.mlp.linear_1.weight
encoder.layers.encoder_layer_24.mlp.linear_1.bias
encoder.layers.encoder_layer_24.mlp.linear_2.weight
encoder.layers.encoder_layer_24.mlp.linear_2.bias
encoder.layers.encoder_layer_25.ln_1.weight
encoder.layers.encoder_layer_25.ln_1.bias
encoder.layers.encoder_layer_25.self_attention.in_proj_weight
encoder.layers.encoder_layer_25.self_attention.in_proj_bias
encoder.layers.encoder_layer_25.self_attention.out_proj.weight
encoder.layers.encoder_layer_25.self_attention.out_proj.bias
encoder.layers.encoder_layer_25.ln_2.weight
encoder.layers.encoder_layer_25.ln_2.bias
encoder.layers.encoder_layer_25.mlp.linear_1.weight
encoder.layers.encoder_layer_25.mlp.linear_1.bias
encoder.layers.encoder_layer_25.mlp.linear_2.weight
encoder.layers.encoder_layer_25.mlp.linear_2.bias
encoder.layers.encoder_layer_26.ln_1.weight
encoder.layers.encoder_layer_26.ln_1.bias
encoder.layers.encoder_layer_26.self_attention.in_proj_weight
encoder.layers.encoder_layer_26.self_attention.in_proj_bias
encoder.layers.encoder_layer_26.self_attention.out_proj.weight
encoder.layers.encoder_layer_26.self_attention.out_proj.bias
encoder.layers.encoder_layer_26.ln_2.weight
encoder.layers.encoder_layer_26.ln_2.bias
encoder.layers.encoder_layer_26.mlp.linear_1.weight
encoder.layers.encoder_layer_26.mlp.linear_1.bias
encoder.layers.encoder_layer_26.mlp.linear_2.weight
encoder.layers.encoder_layer_26.mlp.linear_2.bias
encoder.layers.encoder_layer_27.ln_1.weight
encoder.layers.encoder_layer_27.ln_1.bias
encoder.layers.encoder_layer_27.self_attention.in_proj_weight
encoder.layers.encoder_layer_27.self_attention.in_proj_bias
encoder.layers.encoder_layer_27.self_attention.out_proj.weight
encoder.layers.encoder_layer_27.self_attention.out_proj.bias
encoder.layers.encoder_layer_27.ln_2.weight
encoder.layers.encoder_layer_27.ln_2.bias
encoder.layers.encoder_layer_27.mlp.linear_1.weight
encoder.layers.encoder_layer_27.mlp.linear_1.bias
encoder.layers.encoder_layer_27.mlp.linear_2.weight
encoder.layers.encoder_layer_27.mlp.linear_2.bias
encoder.layers.encoder_layer_28.ln_1.weight
encoder.layers.encoder_layer_28.ln_1.bias
encoder.layers.encoder_layer_28.self_attention.in_proj_weight
encoder.layers.encoder_layer_28.self_attention.in_proj_bias
encoder.layers.encoder_layer_28.self_attention.out_proj.weight
encoder.layers.encoder_layer_28.self_attention.out_proj.bias
encoder.layers.encoder_layer_28.ln_2.weight
encoder.layers.encoder_layer_28.ln_2.bias
encoder.layers.encoder_layer_28.mlp.linear_1.weight
encoder.layers.encoder_layer_28.mlp.linear_1.bias
encoder.layers.encoder_layer_28.mlp.linear_2.weight
encoder.layers.encoder_layer_28.mlp.linear_2.bias
encoder.layers.encoder_layer_29.ln_1.weight
encoder.layers.encoder_layer_29.ln_1.bias
encoder.layers.encoder_layer_29.self_attention.in_proj_weight
encoder.layers.encoder_layer_29.self_attention.in_proj_bias
encoder.layers.encoder_layer_29.self_attention.out_proj.weight
encoder.layers.encoder_layer_29.self_attention.out_proj.bias
encoder.layers.encoder_layer_29.ln_2.weight
encoder.layers.encoder_layer_29.ln_2.bias
encoder.layers.encoder_layer_29.mlp.linear_1.weight
encoder.layers.encoder_layer_29.mlp.linear_1.bias
encoder.layers.encoder_layer_29.mlp.linear_2.weight
encoder.layers.encoder_layer_29.mlp.linear_2.bias
encoder.layers.encoder_layer_30.ln_1.weight
encoder.layers.encoder_layer_30.ln_1.bias
encoder.layers.encoder_layer_30.self_attention.in_proj_weight
encoder.layers.encoder_layer_30.self_attention.in_proj_bias
encoder.layers.encoder_layer_30.self_attention.out_proj.weight
encoder.layers.encoder_layer_30.self_attention.out_proj.bias
encoder.layers.encoder_layer_30.ln_2.weight
encoder.layers.encoder_layer_30.ln_2.bias
encoder.layers.encoder_layer_30.mlp.linear_1.weight
encoder.layers.encoder_layer_30.mlp.linear_1.bias
encoder.layers.encoder_layer_30.mlp.linear_2.weight
encoder.layers.encoder_layer_30.mlp.linear_2.bias
encoder.layers.encoder_layer_31.ln_1.weight
encoder.layers.encoder_layer_31.ln_1.bias
encoder.layers.encoder_layer_31.self_attention.in_proj_weight
encoder.layers.encoder_layer_31.self_attention.in_proj_bias
encoder.layers.encoder_layer_31.self_attention.out_proj.weight
encoder.layers.encoder_layer_31.self_attention.out_proj.bias
encoder.layers.encoder_layer_31.ln_2.weight
encoder.layers.encoder_layer_31.ln_2.bias
encoder.layers.encoder_layer_31.mlp.linear_1.weight
encoder.layers.encoder_layer_31.mlp.linear_1.bias
encoder.layers.encoder_layer_31.mlp.linear_2.weight
encoder.layers.encoder_layer_31.mlp.linear_2.bias
encoder.ln.weight
encoder.ln.bias
heads.head.weight
heads.head.bias
------------------------------
